<?php
/**
* @copyright Copyright (c) 2008 – 2016 www.08cms.com
* @author 08cms项目开发团队
* @package 08cms
* create date 2016年6月23日
*/
namespace OAuthBundle\Services\Baidu;

class ErrorCode
{
    public function getText()
    {
        return array(
            
            '1' => '服务器内部错误',
            '2' => '参数错误',
            '3' => 'http method错误',
            '21' => '此操作为批量操作',
            '22' => '同步到检索失败',
            '31' => '服务端加锁失败',
            '32' => '服务端释放锁失败',
            '1001' => '表的name重复',
            '1002' => '表的数量达到了最大值',
            '1003' => '表中存在poi数据，不允许删除',
            '2001' => '列的key重复',
            '2002' => '列的key是保留字段',
            '2003' => '列的数量达到了最大值',
            '2004' => '唯一索引只能创建一个',
            '2005' => '更新为唯一索引失败，原poi数据中有重复',
            '2011' => '排序筛选字段只能用于整数或小数类型的列',
            '2012' => '排序筛选的列已经达到了最大值',
            '2021' => '检索字段只能用于字符串类型的列且最大长度不能超过512个字节',
            '2022' => '检索的列已经达到了最大值',
            '2031' => '索引的列已经达到了最大值',
            '2041' => '指定的列不存在',
            '2042' => '修改max_length必须比原值大',
            '3001' => '更新坐标必须包含经纬度和类型',
            '3002' => '唯一索引字段存在重复',
            '3031' => '上传的文件太大',

        );
    }
}